import React, { useRef, useState } from 'react'
import { useOnClickOutside } from 'usehooks-ts'
import { IoClose } from "react-icons/io5";
const CompetitonTerms = () => {
    const[showterms, setShowTerms] = useState(true)
    const ref = useRef(null)

    const handleClickOutside = () => {
      console.log('clicked outside')
      setShowTerms(false)
    }

  
    useOnClickOutside(ref, handleClickOutside)
  return (
   <>{ showterms&& <div className='overlay overlay_full_page' ref={ref} >
            
          <div className="white-background comp-terms ">
            <span className="icon" onClick={()=>setShowTerms(false)}><IoClose /></span>
            <h3>شروط واحكام المسابقة </h3>
          <ul>
            <li>1.	1.	هذه المسابقة تحت اشراف وزارة التضامن الاجتماعي بترخيص رقم (33) لسنة 2024 وجهاز حماية المستهلك بإخطار رقم (81) لسنة .2024</li>
            <li>2.	يقوم المتسابق بتسجيل فيديو بنفسه بجودة عالية يتضمن تسجيل صوتي بتلاوة للقرآن الكريم أودعاء أوابتهال أوانشاد.</li>
            <li>3.	لا يجب أن يزيد مدة الفيديو عن دقيقة واحدة.</li>
            <li>4.	يقوم المتسابق بتحميل المحتوى الذي تم تسجيله على الموقع.</li>
            <li>5.	سوف يتم تعليق الفيديو الى أن يتم مراجتعه من قبل الفريق المختص قبل نشر الفيديو على الموقع.</li>
            <li>6.	بعد نشر الفيديو على الموقع ، يقوم باقي المشتركين بالتصويت للفيديو صاحب الصوت الأفضل.</li>
            <li>7.	يتم تحديد الفائزون المحتملون بناء على أعلى نسبه تصويت من المشتركين الآخرين على الموقع.</li>
            <li>8.	يقوم الفريق الخاص بدكتور "علي جمعة" بمشاهدة الفيديوهات صاحبة أعلى نسبة تصويت ليتم تحديد الأفضل من الناحية اللغوية والمحتوى الديني.</li>
            <li>9.	أعلي فيديو يحصل علي نسبه تصويت من المشتركين في المسابقه بالإضافة الى التقييم الخاص من قبل دكتور "علي جمعة"يحصل علي جنيه دهب.</li>
            <li>10.	يفوز 2 متسابقين لهم أعلى تصويت وتقييم في خلال شهر رمضان المبارك على أن يتم استلام الجائزة خلال 15يوم من انتهاء الشهر الكريم.</li>
            <li>11.	يمكن اضافه عدد فيديوهات مختلفة لنفس المتسابق للحصول على فرص أعلى للفوز  بحد أقصى10  فيديوهات بحد اقصي فيديو واحد فقط يوميا من نفس رقم المحمول المشترك في المسابقه من خلاله.</li>
            <li>12.	يجب على المتسابق دفع الاشتراك اليومي الخاص بالموقع (1.5 ج يوميا) من أول يوم اشتراك وحتى اعلان النتيجة لكي يكون مستحق استلام الجائزة في حالة الفوز.</li>
            <li>13.	عند الغاء الاشتراك في الموقع قبل نهاية شهر رمضان يفقد المشترك فرصه في الفوز.</li>
            <li>14.	يعتبر  تحميل المحتوى على الموقع عن طريق المتسابق هو بمثابة تأكيد منه يعطي لاداره الموقع الحق في استغلال و نشر المحتوى الخاص به على الموقع وأيضا في جميع منصات التواصل الاجتماعي.</li>
            <li>15.	في حاله فوز أي من المتسابقين يمكن له الاشتراك مرةأخرى عن طريق تحميل محتوى جديد في المسابقات المستقبلية.</li>
          </ul>
          <div className="terms-btn" onClick={()=>setShowTerms(false)}>OK</div>
            </div>
   </div>}
   </>
  )
}

export default CompetitonTerms