import React, { useRef, useState } from 'react'
import { useOnClickOutside } from 'usehooks-ts'
import { IoClose } from "react-icons/io5";
const CompetitonTerms = () => {
    const[showterms, setShowTerms] = useState(true)
    const ref = useRef(null)

    const handleClickOutside = () => {
      console.log('clicked outside')
      setShowTerms(false)
    }

  
    useOnClickOutside(ref, handleClickOutside)
  return (
   <>{ showterms&& <div className='overlay overlay_full_page' ref={ref} >
            
          <div className="white-background comp-terms ">
            <span className="icon" onClick={()=>setShowTerms(false)}><IoClose /></span>
            <h3>شروط واحكام المسابقة </h3>
          <ul>
            <li>1.	هذه المسابقة تحت اشراف وزارة التضامن الاجتماعي بترخيص رقم (69) لسنة 2024 وجهاز حماية المستهلك بإخطار رقم (184) لسنة .2024</li>
            <li>2.	مدة المسابقة: تبدأ من3 يونيو وتنتهي في  31يوليو 2024</li>
            <li>3.		يقوم المتسابق بتسجيل فيديو بنفسه بجودة عالية يتضمن تسجيل صوتي بتلاوة للقرآن الكريم أو دعاء أوابتهال أوانشاد.</li>
            <li>4.		لا يجب أن يزيد مدة الفيديو عن دقيقة واحدة.</li>
            <li>5.	يقوم المتسابق بتحميل المحتوى الذي تم تسجيله على الموقع.</li>
            <li>6.	سوف يتم تعليق الفيديوالى أن يتم مراجتعه من قبل الفريق المختص قبل نشر الفيديو على الموقع.</li>
            <li>7.	بعد نشر الفيديو على الموقع، يقوم باقي المشتركين بالتصويت للفيديو صاحب الصوت الأفضل.</li>
            <li>8.	يتم تحديد الفائزون المحتملون بناء على أعلى نسبه تصويت من المشتركين الآخرين على الموقع.</li>
            <li>9.	يقوم الفريق الخاص بمراجعة الفيديوهات صاحبة أعلى نسبة تصويت ليتم تحديد الأفضل من الناحية اللغوية والمحتوى الديني.</li>
            <li>10.	الفيديو الذي يحصل على أعلى نسبة تصويت من المشتركين وكذلك تقييم المراجعة اللغوية في المسابقه يحصل علي سبيكة دهب.</li>
            <li>11.		يفوز 2 متسابقين لهم أعلى تصويت وتقييم في خلال مدة المسابقة على أن يتم استلام الجائزة خلال 15يوم من انتهاءالمسابقة.</li>
            <li>12.	يمكن تسجيل وتحميل عدد فيديوهات مختلفة لنفس المتسابق للحصول على فرص أعلى للفوز  بحد أقصى10  فيديوهات بحد أقصي فيديو واحد فقط يوميا من نفس رقم المحمول المشترك في المسابقه من خلاله.</li>
            <li>13.	يجب على المتسابق دفع الاشتراك اليومي الخاص بالموقع (1.5 ج يوميا) من أول يوم اشتراك وحتى اعلان النتيجة لكل يكون مستحق استلام الجائزة في حالة الفوز.</li>
            <li>14.	عند الغاء الاشتراك في الموقع قبل نهاية المسابقة يفقد المشترك فرصه في الفوز.	</li>
            <li>15.	يعتبر تحميل المحتوى على الموقع عن طريق المتسابق هو بمثابة تأكيد منه يعطي لاداره الموقع الحق في استغلال و نشر المحتوى الخاص به على الموقع وأيضا في جميع منصات التواصل الاجتماعي.</li>
            <li>16.	في حاله فوز أي من المتسابقين يمكن له الاشتراك مرة أخرى عن طريق تحميل محتوى جديد في المسابقات المستقبلية.</li>
          </ul>
          <div className="terms-btn" onClick={()=>setShowTerms(false)}>OK</div>
            </div>
   </div>}
   </>
  )
}

export default CompetitonTerms